Autodesk.Revit.DB.PartUtils.DivideParts(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.ElementId)
Creates divided parts out of parts.
document:
The document containing the parts.
elementIdsToDivide:
The elements that will be divided.
intersectingReferenceIds:
Intersecting references that will divide the elements.
curveArray:
Array of curves that will divide the elements.
sketchPlaneId:
SketchPlane id for the curves that divide the elements.
Returns:
The newly created PartMaker. null if no parts are divided.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more element ids was not permitted for dividing parts.
Elements should be parts that are not yet divided and maximum distance from an original has not yet been reached.
-or-
One or more element ids was not permitted as intersecting references.
Intersecting references should be levels, grids, or reference planes.
-or-
The element id should refer to a valid SketchPlane.
-or-
The input curveArray contains at least one helical curve and is not supported for this operation.
-or-
The input curveArray contains at least one null pointer and is not supported for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2012